IdeaRS.Connections
ConnectedToType Enumeration
Compatible with IDEA StatiCa 0.0
 A member can be connected to a newly created item or an exiting item
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ConnectedToType
Members
Member name | Value | Description
NewPlate | 0 |  Item is connected to a new plate
ExistingPlate | 1 |  Item is connected to an existing plate
Flange | 2 |  Item is connected to a flange
NewPlate2x | 3 |  Item is connected to a two new parallel plates
See Also
Reference
IdeaRS.Connections.Data Namespace